app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

		if @course.save
---
INSERT INTO "courses" ("name", "course_type", "teaching_type", "exam_type", "credit", "limit_num", "class_room", "course_time", "course_week", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def open
    @course=Course.find_by_id(params[:id])
    @course.update_attributes(open: true)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "courses" SET "open" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open", "t"], ["updated_at", "2018-01-07 05:59:32.147450"], ["id", 1]]

  def close
    @course=Course.find_by_id(params[:id])
    @course.update_attributes(open: false)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "courses" SET "open" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open", "f"], ["updated_at", "2018-01-07 05:59:28.936832"], ["id", 1]]

  def destroy
    @course=Course.find_by_id(params[:id])
    current_user.teaching_courses.delete(@course)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 37]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 37]]

  def advselect
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]

  def list
    #-------QiaoCode--------
    @course=Course.where(:open=>true)

    if student_logged_in?
       @adv_course=current_user.student_courses-current_user.courses
       @course=@course-current_user.courses-current_user.student_courses-@@submit_courses
    end
    if teacher_logged_in?
       if current_user.students.length > 0
---
SELECT "courses".* FROM "courses" WHERE "courses"."open" = $1  [["open", "t"]]
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 2]]

  def schedule

    @section1=Array.new
    @section2=Array.new
    @section3=Array.new
    @section4=Array.new
    @section5=Array.new
    @section6=Array.new
    @section7=Array.new
    @section8=Array.new
    @section9=Array.new
    @section10=Array.new
    @section11=Array.new

    @courses=current_user.courses
    @courses.each do |course|
---
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 236]]

  def select

    @course=Course.find_by_id(params[:id])
		@@submit_courses<<@course

		current_user.unsubmit_num +=1
		current_user.save(:validate => false)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 8]]
UPDATE "users" SET "unsubmit_num" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["unsubmit_num", 3], ["updated_at", "2018-01-06 08:50:29.432622"], ["id", 236]]

  def quit #--------------------------------------------------------------------从已选课表中退选对应课程
    @course=Course.find_by_id(params[:id])
    current_user.courses.delete(@course)

    credit = @course.credit.split("/")[1].to_i
    current_user.sum_credit -= credit

    grade = current_user.grades
    grade.each do |g|
        if g.course_id == @course.id
           if g.is_degree == true
              g.is_degree = false
              g.save(:validate => false)
              current_user.degree_credit -= credit
              current_user.save(:validate => false)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 8]]
SELECT "grades".* FROM "grades" WHERE "grades"."user_id" = $1  [["user_id", 241]]
UPDATE "courses" SET "is_degree" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["is_degree", "f"], ["updated_at", "2018-01-06 11:34:25.643395"], ["id", 9]]
UPDATE "users" SET "sum_credit" = $1, "degree_credit" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["sum_credit", 18], ["degree_credit", 4], ["updated_at", "2018-01-06 11:34:25.652093"], ["id", 236]]

  def deletefromsubmit #--------------------------------------------------------从待提交课表中删除对应课程
  	@course=Course.find_by_id(params[:id])
	  @@submit_courses.delete(@course)

		current_user.unsubmit_num -=1
		current_user.save(:validate => false)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 28]]
UPDATE "users" SET "sum_credit" = $1, "degree_credit" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["sum_credit", -2], ["degree_credit", 1], ["updated_at", "2018-01-02 13:12:05.495833"], ["id", 36]]

  def selectd #------------------------------------------------------------------------选择对应课程为学位课
    @course=Course.find_by_id(params[:id])
		@@submit_courses<<@course

    @course.is_degree = true
    @course.save(:validate => false)

		current_user.unsubmit_num +=1
		current_user.save(:validate => false)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "courses" SET "is_degree" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["is_degree", "t"], ["updated_at", "2018-01-06 08:50:04.251082"], ["id", 2]]
UPDATE "users" SET "sum_credit" = $1, "degree_credit" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["sum_credit", 3], ["degree_credit", 3], ["updated_at", "2017-12-20 07:32:07.521364"], ["id", 36]]

	def submit #-----------------------------------------------------------------------------提交页面显示内容

		if @@submit_courses.length ==0
			current_user.unsubmit_num=0
			current_user.save(:validate => false)
---
UPDATE "users" SET "degree_credit" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["degree_credit", 0], ["updated_at", "2018-01-02 14:28:28.402111"], ["id", 36]]

	def gotosubmit #----------------------------------------------------------------------------------提交操作
		#------------------记录待提交列表中课程时间-------------------------
		@course_day=[]
		@course_start=[]
		@course_end=[]
		@i=0
		@submit_num=0
		@all_courses=[]

		@@submit_courses.each do |course|
			@all_courses<<course
			@submit_num+=1
		end

		current_user.courses.each do |course|
---
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 236]]

					@grade.each do |g|
					    if g.course.id == course.id
					       g.is_degree =true
					       g.save(:validate => false)
---
UPDATE "courses" SET "is_degree" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["is_degree", "f"], ["updated_at", "2018-01-06 08:50:43.272715"], ["id", 2]]

		#end
			@@submit_courses=[]
			current_user.unsubmit_num=0
			current_user.save(:validate => false)
---
UPDATE "users" SET "sum_credit" = $1, "degree_credit" = $2, "unsubmit_num" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["sum_credit", 9], ["degree_credit", 6], ["unsubmit_num", 0], ["updated_at", "2018-01-06 08:50:43.309727"], ["id", 236]]